MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
/*
 * Loop function
 */
void app_loop(void) {
	// Process button events
	processSystemEvents();

	// Run the state machine
	runStateMachine();

	// Reset button states after processing
	stateMachine.outputBtnPressed = false;
	stateMachine.lockBtnPressed = false;
	stateMachine.lockBtnLongPressed = false;
	stateMachine.voltageCurrentBtnPressed = false;
	stateMachine.voltageCurrentBtnLongPressed = false;
	stateMachine.rotaryBtnPressed = false;
	stateMachine.encoderTurnedFlag = false;
	stateMachine.stateTimeoutFlag = false;
	stateMachine.periodicCheckFlag = false;
	stateMachine.encoderTurnedFlag = false;
	stateMachine.awdgTriggeredFlag = false;
}

/*
 * Define Callbacks and ISR
 */
//BTN ISR to set event flags
void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == SW1_TOGGLE_I_V_Pin) {
        btnPressTimes.voltageCurrentBtn = HAL_GetTick();
        systemEvents.btnPressEvent = true;
        //EXTI->IMR1 &= ~(EXTI_IMR1_IM2);
    } else if (GPIO_Pin == SW2_DEBUG_BTN_Pin) {
        btnPressTimes.lockBtn = HAL_GetTick();
        systemEvents.btnPressEvent = true;
        //EXTI->IMR1 &= ~(EXTI_IMR1_IM4);
        //lockButtonPressTime = HAL_GetTick();
    } else if (GPIO_Pin == SW3_OFF_ON_Pin) {
        systemEvents.outputBtnEvent = true;
        //EXTI->IMR1 &= ~(EXTI_IMR1_IM1);
    } else if (GPIO_Pin == ENC_TOGGLE_UNITS_Pin) {
        systemEvents.rotaryBtnEvent = true;
        //EXTI->IMR1 &= ~(EXTI_IMR1_IM8);
    }

    // Store the pressed button in bitmask for tracking debounce
    debouncedPins |= GPIO_Pin;
    // Mask the interrupt for this button
    EXTI->IMR1 &= ~GPIO_Pin;

    // Start debounce timer
    TIM7->ARR = 300;
    LL_TIM_SetCounter(TIM7, 0);
    LL_TIM_EnableCounter(TIM7);
}

/*
 * Define Callbacks and ISR
 */
//BTN ISR to set event flags
void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin) {

	if (systemEvents.btnPressEvent == true) {
		uint32_t releaseTime = HAL_GetTick();

		if (GPIO_Pin == SW1_TOGGLE_I_V_Pin) {
			if ((releaseTime - btnPressTimes.voltageCurrentBtn) > 1000) {
				systemEvents.voltageCurrentBtnLongEvent = true;
			} else {
				systemEvents.voltageCurrentBtnEvent = true;
			}

		} else if (GPIO_Pin == SW2_DEBUG_BTN_Pin) {

			if ((releaseTime - btnPressTimes.lockBtn) > 1000) {
				systemEvents.lockBtnLongEvent = true;
			} else {
				systemEvents.lockBtnEvent = true;
			}
		} else {
			return;
		}

		// Start debounce timer
		TIM7->ARR = 50;
		LL_TIM_SetCounter(TIM7, 0);
		LL_TIM_EnableCounter(TIM7);

		//Reset btnPressEvent
		systemEvents.btnPressEvent = false;

		 // Store the pressed button in bitmask for tracking debounce
		debouncedPins |= GPIO_Pin;
		// Mask the interrupt for this button
		EXTI->IMR1 &= ~GPIO_Pin;
	}
}

//TIM capture callback
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance == TIM3) {
    	systemEvents.encoderTurnEvent = true;
    }
}

/*
 * Timer7 interrupt routine for button debouncing
 */
void TIM7_ISR(void){
	//Unmask exti line 1, 2 and 4,8

	LL_TIM_ClearFlag_UPDATE(TIM7);
	LL_TIM_DisableCounter(TIM7);

	// Unmask only the buttons that were debounced
	EXTI->IMR1 |= debouncedPins;

	// Reset the bitmask after unmasking
	debouncedPins = 0;

}

void TIM14_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM14)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM14);

		// Handle periodic check for ACTIVE state
		systemEvents.periodicCheckEvent = true;
		//Reset CNT value
		LL_TIM_SetCounter(TIM14, 0);

		//Start timer again
		LL_TIM_EnableCounter(TIM14);
	}
}


void TIM15_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM15)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM15);

		// Handle periodic check for ACTIVE state
		systemEvents.stateTimeoutEvent = true;
		//Reset CNT value
		//LL_TIM_DisableCounter(TIM15);  // Stop the timer after timeout

	}
}

/*
 * Define Process functions
 */
// Process button events in the main loop (Convert hardware events into logical events)
void processButtonEvents(void) {
    if (events->outputBtnEvent) {
    	//Reset btn event flag
        events->outputBtnEvent = false;
        sm->outputBtnPressed = true;

    } else if (events->voltageCurrentBtnEvent) {
    	events->voltageCurrentBtnEvent = false;
    	sm->voltageCurrentBtnPressed = true;
    } else if (events->voltageCurrentBtnLongEvent) {
       	events->voltageCurrentBtnLongEvent = false;
       	sm->voltageCurrentBtnLongPressed = true;

       	if (sm->pwrMode == MODE_FIXED) {
       		sm->pwrMode = MODE_APDO;
       	} else {
       		sm->pwrMode = MODE_FIXED;
       	}

    } else if (events->lockBtnEvent) {
    	events->lockBtnEvent = false;

    	if (sm->lockMode == UNLOCKED) {
    		sm->lockBtnPressed = true;

			//Toggle OCP mode
			switch(sm->OCPMode) {
				case OCP_DISABLED:
					sm->OCPMode = OCP_ENABLED;

					//Update AWD limits
					int isense_Vtrip_mV = (dhandle->currentSet *G_SENSE*R_SENSE_MOHMS)/1000; // mV  (mA * mOhms * Gain)
					int isense_rawADCtrip= (isense_Vtrip_mV *4095) / VDDA_APPLI; //value for AWD treshold
					Update_AWD_Thresholds(0, isense_rawADCtrip, ADC_ANALOGWATCHDOG_2);
					break;
				case OCP_ENABLED:
					sm->OCPMode = OCP_DISABLED;
					//Update AWD limits
					Update_AWD_Thresholds(0, OCP_DISABLED_HT, ADC_ANALOGWATCHDOG_2);

					//__HAL_ADC_DISABLE_IT(&hadc1, ADC_IT_AWD2); can be also used to write bit but
					//only when ADSTART bit is cleared to 0 (this ensures that no conversion is ongoing).
					break;
			}
    	}

    } else if (events->lockBtnLongEvent) {
    	events->lockBtnLongEvent = false;
    	sm->lockBtnLongPressed = true;

    	if (sm->lockMode == LOCKED) {
    		sm->lockMode = UNLOCKED;

    		//Drive lock LED
    		HAL_GPIO_WritePin(LED_LOCK_GPIO_Port, LED_LOCK_Pin, GPIO_PIN_RESET);

    		// Mask buttons except OUT
    		EXTI->IMR1 |= EXTI_IMR1_IM8; //unmask ENCbtn
    		EXTI->IMR1 |= EXTI_IMR1_IM2; //unmask SW1 I/V
    	} else {
    		sm->lockMode = LOCKED;

    		//Drive lock LED
    		HAL_GPIO_WritePin(LED_LOCK_GPIO_Port, LED_LOCK_Pin, GPIO_PIN_SET);

    		// Unmask buttons except OUT
    		EXTI->IMR1 &= ~(EXTI_IMR1_IM2); // mask SW1 I/V
    		EXTI->IMR1 &= ~(EXTI_IMR1_IM8); // mask ENCbtnt
    	}

    } else if (events->rotaryBtnEvent) {
    	//Reset btn event flag
    	events->rotaryBtnEvent = false;
		sm->rotaryBtnPressed = true;

